欧拉函数
φ(n)

对于欧拉函数有如下三条性质 p为素数
1、phi(p) = p - 1
2、当p与i互质时有: phi(p * i) = phi(p) * phi(i)
3、当i % p == 0时有：phi(p * i) = p * phi(i)

φ函数的值：

φ(x) = x(1 - 1 / p(1))(1 - 1 / p(2))(1 - 1 / p(3))(1 - 1 / p(4))…..(1 - 1 / p(n))

其中p(1), p(2)…p(n)为x的所有质因数; x是正整数; φ(1) = 1(唯一和1互质的数，且小于等于1)。注意：每种质因数只有一个。

例如 :

φ(10) = 10×(1 - 1 / 2)×(1 - 1 / 5) = 4;

1 3 7 9

φ(30) = 30×(1 - 1 / 2)×(1 - 1 / 3)×(1 - 1 / 5) = 8;

φ(49) = 49×(1 - 1 / 7) = 42;
————————————————

int euler(int n){
	int ans = n;
	for (int i = 2; i * i <= n; i++){
		if (n % i == 0){
			ans = ans / i * (i - 1); //先进行除法防止溢出(ret=ret*(1-1/p(i)))
			while (n % i == 0)
				n /= i;
		}
	}
	if (n > 1) ans = ans / n * (n - 1);
	return ans;
}
——————————————————————————

